app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Science"], ["room_number", 208], ["created_at", "2020-10-07 21:07:55.165621"], ["updated_at", "2020-10-07 21:07:55.165621"]]
---
    def create
        schoolclass = SchoolClass.create(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 222], ["updated_at", "2020-10-07 21:15:05.359133"], ["id", 1]]
---
    def update
        schoolclass = SchoolClass.find(params[:id])
        schoolclass.update(school_class_params)