app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Dean"], ["updated_at", "2020-10-07 20:43:16.715084"], ["id", 8]]
---
    def update
        student = Student.find(params[:id])
        student.update(student_params)